RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Inc/stm32g4xx_ll_adc.h
/**
  * @brief  Set one context on ADC group injected that will be checked in
  *         contexts queue.
  * @note   A context is a setting of group injected sequencer:
  *         - group injected trigger
  *         - sequencer length
  *         - sequencer ranks
  *         This function is intended to be used when contexts queue is enabled,
  *         because the sequence must be fully configured in one time
  *         (functions to set separately injected trigger and sequencer channels
  *         cannot be used):
  *         Refer to function @ref LL_ADC_INJ_SetQueueMode().
  * @note   In the contexts queue, only the active context can be read.
  *         The parameters of this function can be read using functions:
  *         @arg @ref LL_ADC_INJ_GetTriggerSource()
  *         @arg @ref LL_ADC_INJ_GetTriggerEdge()
  *         @arg @ref LL_ADC_INJ_GetSequencerRanks()
  * @note   On this STM32 serie, to measure internal channels (VrefInt,
  *         TempSensor, ...), measurement paths to internal channels must be
  *         enabled separately.
  *         This can be done using function @ref LL_ADC_SetCommonPathInternalCh().
  * @note   On STM32G4, some fast channels are available: fast analog inputs
  *         coming from GPIO pads (ADC_IN1..5).
  * @note   On this STM32 serie, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must not be disabled. Can be enabled with or without conversion
  *         on going on either groups regular or injected.
  * @rmtoll JSQR     JEXTSEL        LL_ADC_INJ_ConfigQueueContext\n
  *         JSQR     JEXTEN         LL_ADC_INJ_ConfigQueueContext\n
  *         JSQR     JL             LL_ADC_INJ_ConfigQueueContext\n
  *         JSQR     JSQ1           LL_ADC_INJ_ConfigQueueContext\n
  *         JSQR     JSQ2           LL_ADC_INJ_ConfigQueueContext\n
  *         JSQR     JSQ3           LL_ADC_INJ_ConfigQueueContext\n
  *         JSQR     JSQ4           LL_ADC_INJ_ConfigQueueContext
  * @param  ADCx ADC instance
  * @param  TriggerSource This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_SOFTWARE
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM1_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM1_TRGO2
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM1_CH3         (2)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM1_CH4
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM2_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM2_CH1         (1)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM3_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM3_CH1         (1)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM3_CH3         (1)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM3_CH4         (1)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM4_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM4_CH3         (2)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM4_CH4         (2)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM6_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM7_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM8_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM8_TRGO2
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM8_CH2         (2)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM8_CH4
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM15_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM16_CH1        (1)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM20_TRGO
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM20_TRGO2
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM20_CH2        (2)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_TIM20_CH4        (1)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG1       (2)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG2
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG3       (2)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG4
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG5
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG6
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG7
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG8
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG9
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_HRTIM_TRG10
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_EXTI_LINE3       (2)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_EXTI_LINE15      (1)
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_LPTIM_OUT
  *
  *         (1) On STM32G4 serie, parameter not available on all ADC instances: ADC1, ADC2.\n
  *         (2) On STM32G4 serie, parameter not available on all ADC instances: ADC3, ADC4, ADC5.
  *             On this STM32 serie, all ADCx are not available on all devices. Refer to device datasheet for more details.
  * @param  ExternalTriggerEdge This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_RISING
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_FALLING
  *         @arg @ref LL_ADC_INJ_TRIG_EXT_RISINGFALLING
  *
  *         Note: This parameter is discarded in case of SW start:
  *               parameter "TriggerSource" set to "LL_ADC_INJ_TRIG_SOFTWARE".
  * @param  SequencerNbRanks This parameter can be one of the following values:
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_DISABLE
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS
  *         @arg @ref LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS
  * @param  Rank1_Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1                 (8)
  *         @arg @ref LL_ADC_CHANNEL_2                 (8)
  *         @arg @ref LL_ADC_CHANNEL_3                 (8)
  *         @arg @ref LL_ADC_CHANNEL_4                 (8)
  *         @arg @ref LL_ADC_CHANNEL_5                 (8)
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_14
  *         @arg @ref LL_ADC_CHANNEL_15
  *         @arg @ref LL_ADC_CHANNEL_16
  *         @arg @ref LL_ADC_CHANNEL_17
  *         @arg @ref LL_ADC_CHANNEL_18
  *         @arg @ref LL_ADC_CHANNEL_VREFINT           (7)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR_ADC1   (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR_ADC5   (5)
  *         @arg @ref LL_ADC_CHANNEL_VBAT              (6)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1           (1)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2           (2)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3_ADC2      (2)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3_ADC3      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP4           (5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP5           (5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP6           (4)
  *
  *         (1) On STM32G4, parameter available only on ADC instance: ADC1.\n
  *         (2) On STM32G4, parameter available only on ADC instance: ADC2.\n
  *         (3) On STM32G4, parameter available only on ADC instance: ADC3.\n
  *         (4) On STM32G4, parameter available only on ADC instance: ADC4.\n
  *         (5) On STM32G4, parameter available only on ADC instance: ADC5.\n
  *         (6) On STM32G4, parameter available only on ADC instances: ADC1, ADC3, ADC5.\n
  *         (7) On STM32G4, parameter available only on ADC instances: ADC1, ADC3, ADC4, ADC5.\n
  *          -  On this STM32 serie, all ADCx are not available on all devices. Refer to device datasheet for more details.
  *         (8) On STM32G4, fast channel allows: 2.5 (sampling) + 12.5 (conversion) = 15 ADC clock cycles (fADC) to convert in 12-bit resolution.
  *             Other channels are slow channels  allows: 6.5 (sampling) + 12.5 (conversion) = 19 ADC clock cycles (fADC) to convert in 12-bit resolution.\n
  * @param  Rank2_Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1                 (8)
  *         @arg @ref LL_ADC_CHANNEL_2                 (8)
  *         @arg @ref LL_ADC_CHANNEL_3                 (8)
  *         @arg @ref LL_ADC_CHANNEL_4                 (8)
  *         @arg @ref LL_ADC_CHANNEL_5                 (8)
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_14
  *         @arg @ref LL_ADC_CHANNEL_15
  *         @arg @ref LL_ADC_CHANNEL_16
  *         @arg @ref LL_ADC_CHANNEL_17
  *         @arg @ref LL_ADC_CHANNEL_18
  *         @arg @ref LL_ADC_CHANNEL_VREFINT           (7)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR_ADC1   (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR_ADC5   (5)
  *         @arg @ref LL_ADC_CHANNEL_VBAT              (6)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1           (1)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2           (2)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3_ADC2      (2)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3_ADC3      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP4           (5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP5           (5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP6           (4)
  *
  *         (1) On STM32G4, parameter available only on ADC instance: ADC1.\n
  *         (2) On STM32G4, parameter available only on ADC instance: ADC2.\n
  *         (3) On STM32G4, parameter available only on ADC instance: ADC3.\n
  *         (4) On STM32G4, parameter available only on ADC instance: ADC4.\n
  *         (5) On STM32G4, parameter available only on ADC instance: ADC5.\n
  *         (6) On STM32G4, parameter available only on ADC instances: ADC1, ADC3, ADC5.\n
  *         (7) On STM32G4, parameter available only on ADC instances: ADC1, ADC3, ADC4, ADC5.\n
  *          -  On this STM32 serie, all ADCx are not available on all devices. Refer to device datasheet for more details.
  *         (8) On STM32G4, fast channel allows: 2.5 (sampling) + 12.5 (conversion) = 15 ADC clock cycles (fADC) to convert in 12-bit resolution.
  *             Other channels are slow channels  allows: 6.5 (sampling) + 12.5 (conversion) = 19 ADC clock cycles (fADC) to convert in 12-bit resolution.\n
  * @param  Rank3_Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1                 (8)
  *         @arg @ref LL_ADC_CHANNEL_2                 (8)
  *         @arg @ref LL_ADC_CHANNEL_3                 (8)
  *         @arg @ref LL_ADC_CHANNEL_4                 (8)
  *         @arg @ref LL_ADC_CHANNEL_5                 (8)
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_14
  *         @arg @ref LL_ADC_CHANNEL_15
  *         @arg @ref LL_ADC_CHANNEL_16
  *         @arg @ref LL_ADC_CHANNEL_17
  *         @arg @ref LL_ADC_CHANNEL_18
  *         @arg @ref LL_ADC_CHANNEL_VREFINT           (7)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR_ADC1   (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR_ADC5   (5)
  *         @arg @ref LL_ADC_CHANNEL_VBAT              (6)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1           (1)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2           (2)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3_ADC2      (2)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3_ADC3      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP4           (5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP5           (5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP6           (4)
  *
  *         (1) On STM32G4, parameter available only on ADC instance: ADC1.\n
  *         (2) On STM32G4, parameter available only on ADC instance: ADC2.\n
  *         (3) On STM32G4, parameter available only on ADC instance: ADC3.\n
  *         (4) On STM32G4, parameter available only on ADC instance: ADC4.\n
  *         (5) On STM32G4, parameter available only on ADC instance: ADC5.\n
  *         (6) On STM32G4, parameter available only on ADC instances: ADC1, ADC3, ADC5.\n
  *         (7) On STM32G4, parameter available only on ADC instances: ADC1, ADC3, ADC4, ADC5.\n
  *          -  On this STM32 serie, all ADCx are not available on all devices. Refer to device datasheet for more details.
  *         (8) On STM32G4, fast channel allows: 2.5 (sampling) + 12.5 (conversion) = 15 ADC clock cycles (fADC) to convert in 12-bit resolution.
  *             Other channels are slow channels  allows: 6.5 (sampling) + 12.5 (conversion) = 19 ADC clock cycles (fADC) to convert in 12-bit resolution.\n
  * @param  Rank4_Channel This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_0
  *         @arg @ref LL_ADC_CHANNEL_1                 (8)
  *         @arg @ref LL_ADC_CHANNEL_2                 (8)
  *         @arg @ref LL_ADC_CHANNEL_3                 (8)
  *         @arg @ref LL_ADC_CHANNEL_4                 (8)
  *         @arg @ref LL_ADC_CHANNEL_5                 (8)
  *         @arg @ref LL_ADC_CHANNEL_6
  *         @arg @ref LL_ADC_CHANNEL_7
  *         @arg @ref LL_ADC_CHANNEL_8
  *         @arg @ref LL_ADC_CHANNEL_9
  *         @arg @ref LL_ADC_CHANNEL_10
  *         @arg @ref LL_ADC_CHANNEL_11
  *         @arg @ref LL_ADC_CHANNEL_12
  *         @arg @ref LL_ADC_CHANNEL_13
  *         @arg @ref LL_ADC_CHANNEL_14
  *         @arg @ref LL_ADC_CHANNEL_15
  *         @arg @ref LL_ADC_CHANNEL_16
  *         @arg @ref LL_ADC_CHANNEL_17
  *         @arg @ref LL_ADC_CHANNEL_18
  *         @arg @ref LL_ADC_CHANNEL_VREFINT           (7)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR_ADC1   (1)
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR_ADC5   (5)
  *         @arg @ref LL_ADC_CHANNEL_VBAT              (6)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP1           (1)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP2           (2)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3_ADC2      (2)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP3_ADC3      (3)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP4           (5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP5           (5)
  *         @arg @ref LL_ADC_CHANNEL_VOPAMP6           (4)
  *
  *         (1) On STM32G4, parameter available only on ADC instance: ADC1.\n
  *         (2) On STM32G4, parameter available only on ADC instance: ADC2.\n
  *         (3) On STM32G4, parameter available only on ADC instance: ADC3.\n
  *         (4) On STM32G4, parameter available only on ADC instance: ADC4.\n
  *         (5) On STM32G4, parameter available only on ADC instance: ADC5.\n
  *         (6) On STM32G4, parameter available only on ADC instances: ADC1, ADC3, ADC5.\n
  *         (7) On STM32G4, parameter available only on ADC instances: ADC1, ADC3, ADC4, ADC5.\n
  *          -  On this STM32 serie, all ADCx are not available on all devices. Refer to device datasheet for more details.
  *         (8) On STM32G4, fast channel allows: 2.5 (sampling) + 12.5 (conversion) = 15 ADC clock cycles (fADC) to convert in 12-bit resolution.
  *             Other channels are slow channels  allows: 6.5 (sampling) + 12.5 (conversion) = 19 ADC clock cycles (fADC) to convert in 12-bit resolution.\n
  * @retval None
  */
__STATIC_INLINE void LL_ADC_INJ_ConfigQueueContext(ADC_TypeDef *ADCx,
                                                   uint32_t TriggerSource,
                                                   uint32_t ExternalTriggerEdge,
                                                   uint32_t SequencerNbRanks,
                                                   uint32_t Rank1_Channel,
                                                   uint32_t Rank2_Channel,
                                                   uint32_t Rank3_Channel,
                                                   uint32_t Rank4_Channel)
{
  /* Set bits with content of parameter "Rankx_Channel" with bits position    */
  /* in register depending on literal "LL_ADC_INJ_RANK_x".                    */
  /* Parameters "Rankx_Channel" and "LL_ADC_INJ_RANK_x" are used with masks   */
  /* because containing other bits reserved for other purpose.                */
  /* If parameter "TriggerSource" is set to SW start, then parameter          */
  /* "ExternalTriggerEdge" is discarded.                                      */
  register uint32_t is_trigger_not_sw = (uint32_t)((TriggerSource != LL_ADC_INJ_TRIG_SOFTWARE) ? 1UL : 0UL);
  MODIFY_REG(ADCx->JSQR,
             ADC_JSQR_JEXTSEL |
             ADC_JSQR_JEXTEN  |
             ADC_JSQR_JSQ4    |
             ADC_JSQR_JSQ3    |
             ADC_JSQR_JSQ2    |
             ADC_JSQR_JSQ1    |
             ADC_JSQR_JL,
             (TriggerSource & ADC_JSQR_JEXTSEL)          |
             (ExternalTriggerEdge * (is_trigger_not_sw)) |
             (((Rank4_Channel & ADC_CHANNEL_ID_NUMBER_MASK) >> ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS) << (LL_ADC_INJ_RANK_4 & ADC_INJ_RANK_ID_JSQR_MASK)) |
             (((Rank3_Channel & ADC_CHANNEL_ID_NUMBER_MASK) >> ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS) << (LL_ADC_INJ_RANK_3 & ADC_INJ_RANK_ID_JSQR_MASK)) |
             (((Rank2_Channel & ADC_CHANNEL_ID_NUMBER_MASK) >> ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS) << (LL_ADC_INJ_RANK_2 & ADC_INJ_RANK_ID_JSQR_MASK)) |
             (((Rank1_Channel & ADC_CHANNEL_ID_NUMBER_MASK) >> ADC_CHANNEL_ID_NUMBER_BITOFFSET_POS) << (LL_ADC_INJ_RANK_1 & ADC_INJ_RANK_ID_JSQR_MASK)) |
             SequencerNbRanks
            );
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Configuration_Channels Configuration of ADC hierarchical scope: channels
  * @{
  */

